BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/Roadster/Archive/Roadster.Bundle01/Roadster1.0.cydsn/Generated_Source/PSoC5/statusEcho.h
/*******************************************************************************
* File Name: statusEcho.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_statusEcho_H) /* CY_STATUS_REG_statusEcho_H */
#define CY_STATUS_REG_statusEcho_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} statusEcho_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 statusEcho_Read(void) ;
void statusEcho_InterruptEnable(void) ;
void statusEcho_InterruptDisable(void) ;
void statusEcho_WriteMask(uint8 mask) ;
uint8 statusEcho_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define statusEcho_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define statusEcho_INPUTS              1


/***************************************
*             Registers
***************************************/

/* Status Register */
#define statusEcho_Status             (* (reg8 *) statusEcho_sts_sts_reg__STATUS_REG )
#define statusEcho_Status_PTR         (  (reg8 *) statusEcho_sts_sts_reg__STATUS_REG )
#define statusEcho_Status_Mask        (* (reg8 *) statusEcho_sts_sts_reg__MASK_REG )
#define statusEcho_Status_Aux_Ctrl    (* (reg8 *) statusEcho_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_statusEcho_H */


/* [] END OF FILE */
